let date = new Date();
let copyright = document.getElementById("footer").innerHTML = `${date.getFullYear()} &copy; صنع بكل حب بواسطة مصطفى علاء`;


let dictionary = [
    /* علامات الترقيم، علامات العطف، والمسافات */
    [/^\s+/g, ""],
    [/\s\s+/g, " "],
    [/(?<![\u0621-\u064A]+)(و)\s+/gm, "و"],
    [/(?<![\u0621-\u064A])(ف)\s+/gm, "ف"],
    [/(?=[\u0621-\u064A]+)?،/g, "، "],
    [/(?=[\u0621-\u064A]+)?:/g, ": "],
    [/(?=[\u0621-\u064A]+)?؛/g, "؛ "],
    [/(?=[\u0621-\u064A]+)?\./g, ". "],
    [/(\s)([؛،.؟!:])/g, match => [...match].pop()],
    [/([؟!])(\.)/g, match => [...match].shift()],
    [/\s+؟/g, "؟ "],
    [/(?=[\u0621-\u064A]+)?!/g, "! "],
    [/(?=[\u0621-\u064A]+)?؟/g, "؟ "],
    [/([@#$%^&*()_+\-=\[\]{}؛':"\\|،.<>\/؟!]*)(\s+)([@#$%^&*()_+\-=\[\]{}؛':"\\|،.<>\/؟!]+)/g, match => match.split(" ").join("")], 
    [/\s*\(\s*/g, "("],
    [/\s*\)\s*/g, ")"],
    [/\s*\<\s*/g, "<"],
    [/\s*\>\s*/g, ">"],
    [/^(ال)(\s)?(?=[a-zA-Z])/g, "الـ"],
    [/(?<=(\s|و|ف))(ال)(\s)?(?=[a-zA-Z])/g, "الـ"],
    [/^(ل)(\s)?(?=[a-zA-Z])/g, "لـ"],
    [/(?<=(\s|و|ف))(ل)(\s)?(?=[a-zA-Z])/g, "لـ"],
    [/^(لل)(\s)?(?=[a-zA-Z])/g, "للـ"],
    [/(?<=(\s|و|ف))(لل)(\s)?(?=[a-zA-Z])/g, "للـ"],
    [/^(ك)(\s)?(?=[a-zA-Z])/g, "كـ"],
    [/(?<=(\s|و|ف))(ك)(\s)?(?=[a-zA-Z])/g, "كـ"],
    [/^(ف)(\s)?(?=[a-zA-Z])/g, "فـ"],
    [/(?<=(\s|و|ف))(ف)(\s)?(?=[a-zA-Z])/g, "فـ"],
    [/(عبد)(?=[\u0621-\u064A]+)/g, "عبد "],
/****************************************/    
    /* الضمائر */
    //مذكر مخاطب
    [/(?<=\s+)([اإ]نت)(?![\u0621-\u064A]+)?$/g, "أنت"],
    [/(?<![\u0621-\u064A]+)([اإ]نت)(?=\s+)/g, "أنت"],
    [/\s([اإ]نت)\s/g, " أنت "],
    [/(?<=[؛،.؟!:])\s([اإ]نت)(?![\u0621-\u064A]+)?$/g, " أنت"], 
    [/(?<![\u0621-\u064A]+)([اإ]نت)(?=[؛،\.؟!:,\/])/g, "أنت"], 
    [/^(انت)?(?![\u0621-\u064A]+)$/g, "أنت"], 

    //مؤنث مخاطب 
    [/(?<=\s+)([اإأ]نت(ى|ي))(?![\u0621-\u064A]+)?$/g, "أنتِ"],
    [/(?<![\u0621-\u064A]+)([اإأ]نت(ى|ي))(?=\s+)/g, "أنتِ"],
    [/\s([اإأ]نت(ى|ي))\s/g, " أنتِ "],
    [/(?<=[؛،.؟!:])\s([اإأ]نت(ى|ي))(?![\u0621-\u064A]+)?$/g, " أنتِ"], 
    [/(?<![\u0621-\u064A]+)([اإأ]نت(ى|ي))(?=[؛،\.؟!:,\/])/g, "أنتِ"], 
    [/^([اإأ]نت(ى|ي))?(?![\u0621-\u064A]+)$/g, "أنتِ"],
    
    //متكلم
    [/(?<=\s+)([آإا]نا)(?![\u0621-\u064A]+)?$/gm, "أنا"],
    [/(?<![\u0621-\u064A]+)([آإا]نا)(?=\s+)/gm, "أنا"],
    [/\s([آإا]نا)\s/gm, " أنا "],
    [/(?<=[؛،.؟!:])\s([آإا]نا)(?![\u0621-\u064A]+)?$/gm, " أنا"], 
    [/(?<![\u0621-\u064A]+)([آإا]نا)(?=[؛،\.؟!:,\/])/gm, "أنا"], 
    [/^([آإا]نا)?(?![\u0621-\u064A]+)$/gm, "أنا"],
/****************************************/    
    /* الهمزات */ 
    ["إتفاق", "اتفاق"],
    ["إتفق", "اتفق"],
    ["إجتماع", "اجتماع"],
    ["إجتمع", "اجتمع"],
    ["إقتصاد", "اقتصاد"],
    ["إقتصد", "اقتصد"],
    ["إتفاق", "اتفاق"],
    ["إمتحان", "امتحان"],
    ["إختبار", "اختبار"],
    [/(?<![\u0621-\u064A]+)(اثر)/g, "أثر"],
    [/(ا|أ)تمني(?![\u0621-\u064A]+)$/g, "أتمنى"],
    ["إتمنى", "اتمنى"],
    [/(?<![\u0621-\u064A]+)(اول)/g, "أول"],
    [/(?<![\u0621-\u064A]+)(انك)/g, "أنك"],
    [/(لانك)/g, "لأنك"],
   

    [/(?<=\s+)(اه)(?![\u0621-\u064A]+)?$/g, "أه"],
    [/(?<![\u0621-\u064A]+)(اه)(?=\s+)/g, "أه"],
    [/\s(اه)\s/g, " أه "],
    [/(?<=[؛،.؟!:])\s(اه)(?![\u0621-\u064A]+)?$/g, " أه"], 
    [/(?<![\u0621-\u064A]+)(اه)(?=[؛،\.؟!:,\/])/g, "أه"], 
    [/^(اه)?(?![\u0621-\u064A]+)$/g, "أه"],

    [/(?<=\s+)([اأ]ي(ه|ة))(?![\u0621-\u064A]+)?$/g, "إيه"],
    [/(?<![\u0621-\u064A]+)([اأ]ي(ه|ة))(?=\s+)/g, "إيه"],
    [/\s([اأ]ي(ه|ة))\s/g, " إيه "],
    [/(?<=[؛،.؟!:])\s([اأ]ي(ه|ة))(?![\u0621-\u064A]+)?$/g, " إيه"], 
    [/(?<![\u0621-\u064A]+)([اأ]ي(ه|ة))(?=[؛،\.؟!:,\/])/g, "إيه"], 
    [/^([اأ]ي(ه|ة))?(?![\u0621-\u064A]+)$/g, "إيه"],

    [/(?<=\s+)(([اإ]مل(ي|ى))|(أملى))(?![\u0621-\u064A]+)?$/g, "املا"],
    [/(?<![\u0621-\u064A]+)(([اإ]مل(ي|ى))|(أملى))(?=\s+)/g, "املا"],
    [/\s(([اإ]مل(ي|ى))|(أملى))\s/g, " املا "],
    [/(?<=[؛،.؟!:])\s(([اإ]مل(ي|ى))|(أملى))(?![\u0621-\u064A]+)?$/g, " املا"], 
    [/(?<![\u0621-\u064A]+)(([اإ]مل(ي|ى))|(أملى))(?=[؛،\.؟!:,\/])/g, "املا"], 
    [/^(([اإ]مل(ي|ى))|(أملى))?(?![\u0621-\u064A]+)$/g, "املا"],
    
    [/(?<=\s+)((تمل(ي|ى)))(?![\u0621-\u064A]+)?$/g, "تملا"],
    [/(?<![\u0621-\u064A]+)((تمل(ي|ى)))(?=\s+)/g, "تملا"],
    [/\s((تمل(ي|ى)))\s/g, " تملا "],
    [/(?<=[؛،.؟!:])\s((تمل(ي|ى)))(?![\u0621-\u064A]+)?$/g, " تملا"], 
    [/(?<![\u0621-\u064A]+)((تمل(ي|ى)))(?=[؛،\.؟!:,\/])/g, "تملا"], 
    [/^((تمل(ي|ى)))?(?![\u0621-\u064A]+)$/g, "تملا"],

    [/(?<=\s+)((يمل(ي|ى)))(?![\u0621-\u064A]+)?$/g, "يملا"],
    [/(?<![\u0621-\u064A]+)((يمل(ي|ى)))(?=\s+)/g, "يملا"],
    [/\s((يمل(ي|ى)))\s/g, " يملا "],
    [/(?<=[؛،.؟!:])\s((يمل(ي|ى)))(?![\u0621-\u064A]+)?$/g, " يملا"], 
    [/(?<![\u0621-\u064A]+)((يمل(ي|ى)))(?=[؛،\.؟!:,\/])/g, "يملا"], 
    [/^((يمل(ي|ى)))?(?![\u0621-\u064A]+)$/g, "يملا"],
    
    [/(\s+)(اي)(?=\s*)(?![\u0621-\u064A]+)/g, " أي "],
    [/(?<=[؛،.؟!:])\s(اي)(?![\u0621-\u064A]+)?/g, " أي"], 
    [/(?<![\u0621-\u064A]+)(اي)(?=[؛،\.؟!:,\/])/g, "أي"], 
    [/^(اي)?(?![\u0621-\u064A]+)$/g, "أي"],
    [/(?<=(و|ف|ل))(اي)(?![\u0621-\u064A])?/g, "أي"],
/****************************************/
    /* التاء المربوطة والهاء */
    ["حاجه", "حاجة"],
    ["مسافه", "مسافة"],
    ["إسم", "اسم"],
    ["اسماء", "أسماء"],
    ["إشتري", "اشتري"],
    ["إستخدام", "استخدام"],
    ["إستخدم", "استخدم"],
    ["إستقبال", "استقبال"],
    ["إستقبل", "استقبل"],
    ["بهجه", "بهجة"],
    ["مشاركه", "مشاركة"],
    ["علية", "عليه"],
    ["الوان", "ألوان"],
    ["انوار", "أنوار"],
/****************************************/    
    /* أسماء وكلمات أخرى */
    ["مصطفي", "مصطفى"],
    [/(\s|و)(احمد)|^(احمد)/g, "أحمد"],
    [/[اأ]سلام/g, "إسلام"],
    ["سلمي", "سلمى"],
    ["مروه", "مروة"],
    [/[اأ]روي/g, "أروى"],
    [/(?<![\u0621-\u064A]+)(ت)?(بقي)(?![\u0621-\u064A]+)/g, "أروى"],
    [/[اإ](نشاء)(\s)?(الله)/g, "إن شاء الله"],
    ["شاطيء", "شاطئ"],
    ["شئ", "شيء"],
    ["لاكن", "لكن"],
    ["اللذين", "الذين"],
/****************************************/    
    /* تنوين */
    ["اً", "ًا"],
    [/(بناءا|بناءًا|بناءاً)/g, "بناءً"],
    [/(رجاءا|رجاءًا|رجاءاً)/g, "رجاءً"],
/****************************************/
    /* Abbreviations */
    [/\b([qQ](m)|(qM))\b/g, "QM"],
    [/\b([hH][rR](m)|(hRM)|(hrM))\b/g, "HRM"],
    [/\b([hH](r)|(hR))\b/g, "HR"],
    [/\b([tT][qQ](m)|(tQM)|(tqM))\b/g, "TQM"],
    [/\b([oO](c)|(oC))\b/g, "OC"],
    [/\b([pP](r)|(pR))\b/g, "PR"],
    [/\b([fF](r)|(fR))\b/g, "FR"],
    [/\b([aA](c)|(aC))\b/g, "AC"],
    [/\b([sS][wW](d)|(sWD)|(swD))\b/g, "SWD"],
    [/\b([pP](v)|(pV))\b/g, "PV"],
    [/\b([cC](w)|(cW))\b/g, "CW"],
    [/\b([sS](m)|(sM))\b/g, "SM"],
    [/\b([gG](d)|(gD))\b/g, "GD"],
    [/\b([iI](t)|(iT))\b/g, "IT"],
    [/\bfb\b/g, "FB"],
    [/fl(u|a)tter/g, "Flutter"],
    [/m(i|o|u)nd(e|r|w)(r|e|t)s/g, "Minders"],
    [/fac(e|r)book/g, "Facebook"],
    [/(w|W)hatsapp|(whatsApp)/g, "WhatsApp"],
    [/instagram/g, "Instagram"],
    [/insta/g, "Insta"],
    [/(t|T)iktok|(tikTok)/g, "TikTok"],
    [/(twitter|tweeter|tweter|twiter)/g, "Twitter"],
    [/((y|Y)outube|youTube)/g, "YouTube"],
    
    /* الألف المقصورة والياء اللينة */
    [/(?<=\s+)(إلي|الى|الي|ألى|ألي)(?![\u0621-\u064A]+)?$/g, "إلى"],
    [/(?<![\u0621-\u064A]+)(إلي|الى|الي|ألى|ألي)(?=\s+)/g, "إلى"],
    [/\s(إلي|الى|الي|ألى|ألي)\s/g, " إلى "],
    [/(?<=[؛،.؟!:])\s(إلي|الى|الي|ألى|ألي)(?![\u0621-\u064A]+)?$/g, " إلى"], 
    [/(?<![\u0621-\u064A]+)(إلي|الى|الي|ألى|ألي)(?=[؛،\.؟!:,\/])/g, "إلى"], 
    [/^(إلي|الى|الي|ألى|ألي)?(?![\u0621-\u064A]+)$/g, "إلى"],
    [/(?<![\u0621-\u064A]+)(اليه)/g, "إليه"],
    [/(?<![\u0621-\u064A]+)(حتي)(?![\u0621-\u064A]+)?/g, "حتى"],
    [/(?<![\u0621-\u064A]+)فحتي(?![\u0621-\u064A]+)?/g, "فحتى"]
];


function text() {
    let val = document.getElementById("textarea").value;
    console.log(val);
    let newVal;
    for (let i = 0; i < dictionary.length; i++) {
        val = val.replace(dictionary[i][0], dictionary[i][1]);
        newVal = val;
    }

    return document.getElementById("textarea").value = newVal;
}
